Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_comp.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g032_comp.h
 * @author Nations Solution Team
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#ifndef __N32G032_COMP_H__
#define __N32G032_COMP_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g032.h"
#include <stdbool.h>

/** @addtogroup N32G032_StdPeriph_Driver
 * @{
 */

/** @addtogroup COMP
 * @{
 */

/** @addtogroup COMP_Exported_Constants
 * @{
 */
typedef enum
{
    COMP1 = 0,
    COMP2 = 1,
    COMP3 = 2,
} COMPX;

typedef enum
{
    COMP_CTRL_CLKSEL_SYSTEMCLK            = (0x0L << 20),
    COMP_CTRL_CLKSEL_LSX                  = (0x1L << 20)
} COMP_CTRL_CLKSEL_ENUM;

typedef enum
{
    COMP_CTRL_PWRMD_NORMAL                = (0x0L << 19),
    COMP_CTRL_PWRMD_LOWPWR                = (0x1L << 19)
} COMP_CTRL_PWRMD_ENUM;

typedef enum
{
    COMP_CTRL_BLKING_NO                   = (0x0L << 14),
    COMP_CTRL_BLKING_TIM1_OC5             = (0x1L << 14),
    COMP_CTRL_BLKING_TIM8_OC5             = (0x2L << 14),
} COMP_CTRL_BLKING_ENUM;

typedef enum
{
    COMP_CTRL_HYST_NO                     = (0x0L << 12),
    COMP_CTRL_HYST_LOW                    = (0x1L << 12),
    COMP_CTRL_HYST_MID                    = (0x2L << 12),
    COMP_CTRL_HYST_HIGH                   = (0x3L << 12),
} COMP_CTRL_HYST_ENUM;

typedef enum
{
    COMP_CTRL_POL_NONINVERTED             = (0x0L << 11),
    COMP_CTRL_POL_INVERTED                = (0x1L << 11)
} COMP_CTRL_POL_ENUM;

typedef enum
{
    COMPx_CTRL_OUTTRG_NC                  = (0x0L << 7),
    // comp1 out trig
    COMP1_CTRL_OUTTRG_TIM1_BKIN           = (0x1L << 7),
    COMP1_CTRL_OUTTRG_TIM1_IC1            = (0x2L << 7),
    COMP1_CTRL_OUTTRG_TIM1_OCrefclear     = (0x3L << 7),
    COMP1_CTRL_OUTTRG_TIM8_IC1            = (0x4L << 7),
    COMP1_CTRL_OUTTRG_TIM8_OCrefclear     = (0x5L << 7),
    COMP1_CTRL_OUTTRG_TIM3_IC1            = (0x6L << 7),
    COMP1_CTRL_OUTTRG_TIM3_OCrefclear     = (0x7L << 7),
    COMP1_CTRL_OUTTRG_TIM4_IC1            = (0x9L << 7),
    COMP1_CTRL_OUTTRG_TIM4_OCrefclear     = (0xAL << 7),
    COMP1_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN = (0xBL << 7),
    COMP1_CTRL_OUTTRG_TIM8_BKIN           = (0xCL << 7),
    COMP1_CTRL_OUTTRG_LPTIM_ETR           = (0xDL << 7),
    // comp2 out trig
    COMP2_CTRL_OUTTRG_TIM1_BKIN           = (0x1L << 7),
    COMP2_CTRL_OUTTRG_TIM1_IC1            = (0x2L << 7),
    COMP2_CTRL_OUTTRG_TIM1_OCrefclear     = (0x3L << 7),
    COMP2_CTRL_OUTTRG_TIM8_IC1            = (0x4L << 7),
    COMP2_CTRL_OUTTRG_TIM8_OCrefclear     = (0x5L << 7),
    COMP2_CTRL_OUTTRG_TIM3_IC2            = (0x6L << 7),
    COMP2_CTRL_OUTTRG_TIM3_OCrefclear     = (0x7L << 7),
    COMP2_CTRL_OUTTRG_TIM4_IC2            = (0x9L << 7),
    COMP2_CTRL_OUTTRG_TIM4_OCrefclear     = (0xAL << 7),
    COMP2_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN = (0xBL << 7),
    COMP2_CTRL_OUTTRG_TIM8_BKIN           = (0xCL << 7),
    COMP2_CTRL_OUTTRG_LPTIM_ETR           = (0xDL << 7),
    // comp3 out trig
    COMP3_CTRL_OUTTRG_TIM1_BKIN           = (0x1L << 7),
    COMP3_CTRL_OUTTRG_TIM1_IC1            = (0x2L << 7),
    COMP3_CTRL_OUTTRG_TIM1_OCrefclear     = (0x3L << 7),
    COMP3_CTRL_OUTTRG_TIM8_IC1            = (0x4L << 7),
    COMP3_CTRL_OUTTRG_TIM8_OCrefclear     = (0x5L << 7),
    COMP3_CTRL_OUTTRG_TIM3_IC3            = (0x6L << 7),
    COMP3_CTRL_OUTTRG_TIM3_OCrefclear     = (0x7L << 7),
    COMP3_CTRL_OUTTRG_TIM4_IC3            = (0x9L << 7),
    COMP3_CTRL_OUTTRG_TIM4_OCrefclear     = (0xAL << 7),
    COMP3_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN = (0xBL << 7),
    COMP3_CTRL_OUTTRG_TIM8_BKIN           = (0xCL << 7),
    COMP3_CTRL_OUTTRG_LPTIM_ETR           = (0xDL << 7),
} COMP_CTRL_OUTTRG_ENUM;

typedef enum {
    //comp1 inp sel
    COMP1_CTRL_INPSEL_PA1                 = (0x0L << 4),
    COMP1_CTRL_INPSEL_PA3                 = (0x1L << 4),
    COMP1_CTRL_INPSEL_PA6                 = (0x2L << 4),
    COMP1_CTRL_INPSEL_PA7                 = (0x3L << 4),
    COMP1_CTRL_INPSEL_PA12                = (0x4L << 4),
    COMP1_CTRL_INPSEL_PF7                 = (0x5L << 4),
    //comp2 inp sel
    COMP2_CTRL_INPSEL_PA1                 = (0x0L << 4),
    COMP2_CTRL_INPSEL_PA9                 = (0x1L << 4),
    COMP2_CTRL_INPSEL_PB4                 = (0x2L << 4),
    COMP2_CTRL_INPSEL_PB5                 = (0x3L << 4),
    COMP2_CTRL_INPSEL_PB6                 = (0x4L << 4),
    COMP2_CTRL_INPSEL_PB7                 = (0x5L << 4),
    //comp3 inp sel
    COMP3_CTRL_INPSEL_PF1                 = (0x0L << 4),
    COMP3_CTRL_INPSEL_PC7                 = (0x1L << 4),
    COMP3_CTRL_INPSEL_PA11                = (0x2L << 4),
    COMP3_CTRL_INPSEL_PF6                 = (0x3L << 4),

    COMPx_CTRL_INPSEL_VREF2               = (0x6L << 4),
    COMPx_CTRL_INPSEL_VREF1               = (0x7L << 4),
}COMP_CTRL_INPSEL_ENUM;

