Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_comp.h
typedef enum {
    //comp1 inm sel
    COMP1_CTRL_INMSEL_PA0                 = (0x0L << 1),
    COMP1_CTRL_INMSEL_PA4                 = (0x1L << 1),
    COMP1_CTRL_INMSEL_PA5                 = (0x2L << 1),
    COMP1_CTRL_INMSEL_PF6                 = (0x3L << 1),
    //comp2 inm sel
    COMP2_CTRL_INMSEL_PA3                 = (0x0L << 1),
    COMP2_CTRL_INMSEL_PA2                 = (0x1L << 1),
    COMP2_CTRL_INMSEL_PA4                 = (0x2L << 1),
    COMP2_CTRL_INMSEL_PA5                 = (0x3L << 1),
    COMP2_CTRL_INMSEL_PA8                 = (0x4L << 1),
    COMP2_CTRL_INMSEL_PB3                 = (0x5L << 1),
    //comp3 inm sel
    COMP3_CTRL_INMSEL_PF0                 = (0x0L << 1),
    COMP3_CTRL_INMSEL_PC6                 = (0x1L << 1),
    COMP3_CTRL_INMSEL_PA12                = (0x2L << 1),
    COMP3_CTRL_INMSEL_PF7                 = (0x3L << 1),
 
    COMPx_CTRL_INMSEL_VREF2               = (0x6L << 1),
    COMPx_CTRL_INMSEL_VREF1               = (0x7L << 1),
}COMP_CTRL_INMSEL_ENUM;

typedef enum
{
    COMP_CTRL_EN_ENABLE                   = (0x1L),
    COMP_CTRL_EN_DISABLE                  = (0x0L),
} COMP_CTRL_EN_ENUM;

typedef enum
{
    COMP_WINMODE_CMP12MD_ENABLE           = (0x01L << 0), // 1: Enable Comparators 1 and 2 can be used in window mode.
    COMP_WINMODE_CMP12MD_DISABLE          = (0x00L << 0), // 0: Disable Comparators 1 and 2 can be used in window mode.
} COMP_WINMODE_CMP12MD_ENUM;

typedef enum
{
    COMP_WINMODE_WINMDINSEL_PA3           = (0x01L << 1),
    COMP_WINMODE_WINMDINSEL_PA1           = (0x00L << 1),
} COMP_WINMODE_WINMDINSEL_ENUM;

typedef enum
{
    COMP_INTEN_CMP1IEN_CFG                = (0x01L << 0),
    COMP_INTEN_CMP2IEN_CFG                = (0x01L << 1),
    COMP_INTEN_CMP3IEN_CFG                = (0x01L << 2),
} COMP_INTEN_CMPXIEN_ENUM;

typedef enum
{
    COMP_INTSTS_CMP1IS_STATUS             = (0x01L << 0),
    COMP_INTSTS_CMP2IS_STATUS             = (0x01L << 1),
    COMP_INTSTS_CMP3IS_STATUS             = (0x01L << 2),
} COMP_INTSTS_STATUS_ENUM;

typedef enum {
    COMPX_FILC_SAMPW_0                    = (0x0L << 6),
    COMPX_FILC_SAMPW_1                    = (0x1L << 6),
    COMPX_FILC_SAMPW_2                    = (0x2L << 6),
    COMPX_FILC_SAMPW_3                    = (0x3L << 6),
    COMPX_FILC_SAMPW_4                    = (0x4L << 6),
    COMPX_FILC_SAMPW_5                    = (0x5L << 6),
    COMPX_FILC_SAMPW_6                    = (0x6L << 6),
    COMPX_FILC_SAMPW_7                    = (0x7L << 6),
    COMPX_FILC_SAMPW_8                    = (0x8L << 6),
    COMPX_FILC_SAMPW_9                    = (0x9L << 6),
    COMPX_FILC_SAMPW_10                   = (0xAL << 6),
    COMPX_FILC_SAMPW_11                   = (0xBL << 6),
    COMPX_FILC_SAMPW_12                   = (0xCL << 6),
    COMPX_FILC_SAMPW_13                   = (0xDL << 6),
    COMPX_FILC_SAMPW_14                   = (0xEL << 6),
    COMPX_FILC_SAMPW_15                   = (0xFL << 6),
    COMPX_FILC_SAMPW_16                   = (0x10L << 6),
    COMPX_FILC_SAMPW_17                   = (0x11L << 6),
    COMPX_FILC_SAMPW_18                   = (0x12L << 6),
    COMPX_FILC_SAMPW_19                   = (0x13L << 6),
    COMPX_FILC_SAMPW_20                   = (0x14L << 6),
    COMPX_FILC_SAMPW_21                   = (0x15L << 6),
    COMPX_FILC_SAMPW_22                   = (0x16L << 6),
    COMPX_FILC_SAMPW_23                   = (0x17L << 6),
    COMPX_FILC_SAMPW_24                   = (0x18L << 6),
    COMPX_FILC_SAMPW_25                   = (0x19L << 6),
    COMPX_FILC_SAMPW_26                   = (0x1AL << 6),
    COMPX_FILC_SAMPW_27                   = (0x1BL << 6),
    COMPX_FILC_SAMPW_28                   = (0x1CL << 6),
    COMPX_FILC_SAMPW_29                   = (0x1DL << 6),
    COMPX_FILC_SAMPW_30                   = (0x1EL << 6),
    COMPX_FILC_SAMPW_31                   = (0x1FL << 6)
}COMPX_FILC_SAMPW_ENUM;

typedef enum {
    COMPX_FILC_THRESH_0                   = (0x0L << 1),
    COMPX_FILC_THRESH_1                   = (0x1L << 1),
    COMPX_FILC_THRESH_2                   = (0x2L << 1),
    COMPX_FILC_THRESH_3                   = (0x3L << 1),
    COMPX_FILC_THRESH_4                   = (0x4L << 1),
    COMPX_FILC_THRESH_5                   = (0x5L << 1),
    COMPX_FILC_THRESH_6                   = (0x6L << 1),
    COMPX_FILC_THRESH_7                   = (0x7L << 1),
    COMPX_FILC_THRESH_8                   = (0x8L << 1),
    COMPX_FILC_THRESH_9                   = (0x9L << 1),
    COMPX_FILC_THRESH_10                  = (0xAL << 1),
    COMPX_FILC_THRESH_11                  = (0xBL << 1),
    COMPX_FILC_THRESH_12                  = (0xCL << 1),
    COMPX_FILC_THRESH_13                  = (0xDL << 1),
    COMPX_FILC_THRESH_14                  = (0xEL << 1),
    COMPX_FILC_THRESH_15                  = (0xFL << 1),
    COMPX_FILC_THRESH_16                  = (0x10L << 1),
    COMPX_FILC_THRESH_17                  = (0x11L << 1),
    COMPX_FILC_THRESH_18                  = (0x12L << 1),
    COMPX_FILC_THRESH_19                  = (0x13L << 1),
    COMPX_FILC_THRESH_20                  = (0x14L << 1),
    COMPX_FILC_THRESH_21                  = (0x15L << 1),
    COMPX_FILC_THRESH_22                  = (0x16L << 1),
    COMPX_FILC_THRESH_23                  = (0x17L << 1),
    COMPX_FILC_THRESH_24                  = (0x18L << 1),
    COMPX_FILC_THRESH_25                  = (0x19L << 1),
    COMPX_FILC_THRESH_26                  = (0x1AL << 1),
    COMPX_FILC_THRESH_27                  = (0x1BL << 1),
    COMPX_FILC_THRESH_28                  = (0x1CL << 1),
    COMPX_FILC_THRESH_29                  = (0x1DL << 1),
    COMPX_FILC_THRESH_30                  = (0x1EL << 1),
    COMPX_FILC_THRESH_31                  = (0x1FL << 1),
}COMPX_FILC_THRESH_ENUM;

typedef enum
{
    COMPX_FILC_FILEN_ENABLE               = ((uint32_t)0x0L),
    COMPX_CTRL_FILEN_DISABLE              = ((uint32_t)0x1L)
} COMPX_FILC_FILEN_ENUM;

typedef enum
{
    COMP_LOCK_CMP1LK_LOCK                 = (0x1L << 0),
    COMP_LOCK_CMP1LK_UNLOCK               = (0x0L << 0),
    COMP_LOCK_CMP2LK_LOCK                 = (0x1L << 1),
    COMP_LOCK_CMP2LK_UNLOCK               = (0x0L << 1),
    COMP_LOCK_CMP3LK_LOCK                 = (0x1L << 2),
    COMP_LOCK_CMP3LK_UNLOCK               = (0x0L << 2),
} COMP_LOCK_CMPXLK_ENUM;

