Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_comp.h
typedef enum
{
    VREF1 = 0,
    VREF2 = 1,
} VREFX_ENUM;

typedef enum
{
    COMP_INVREF_VREF1SEL_0                = (0x0L << 1),
    COMP_INVREF_VREF1SEL_1                = (0x1L << 1),
    COMP_INVREF_VREF1SEL_2                = (0x2L << 1),
    COMP_INVREF_VREF1SEL_3                = (0x3L << 1),
    COMP_INVREF_VREF1SEL_4                = (0x4L << 1),
    COMP_INVREF_VREF1SEL_5                = (0x5L << 1),
    COMP_INVREF_VREF1SEL_6                = (0x6L << 1),
    COMP_INVREF_VREF1SEL_7                = (0x7L << 1),
    COMP_INVREF_VREF1SEL_8                = (0x8L << 1),
    COMP_INVREF_VREF1SEL_9                = (0x9L << 1),
    COMP_INVREF_VREF1SEL_10               = (0xAL << 1),
    COMP_INVREF_VREF1SEL_11               = (0xBL << 1),
    COMP_INVREF_VREF1SEL_12               = (0xCL << 1),
    COMP_INVREF_VREF1SEL_13               = (0xDL << 1),
    COMP_INVREF_VREF1SEL_14               = (0xEL << 1),
    COMP_INVREF_VREF1SEL_15               = (0xFL << 1),
    COMP_INVREF_VREF1SEL_16               = (0x10L << 1),
    COMP_INVREF_VREF1SEL_17               = (0x11L << 1),
    COMP_INVREF_VREF1SEL_18               = (0x12L << 1),
    COMP_INVREF_VREF1SEL_19               = (0x13L << 1),
    COMP_INVREF_VREF1SEL_20               = (0x14L << 1),
    COMP_INVREF_VREF1SEL_21               = (0x15L << 1),
    COMP_INVREF_VREF1SEL_22               = (0x16L << 1),
    COMP_INVREF_VREF1SEL_23               = (0x17L << 1),
    COMP_INVREF_VREF1SEL_24               = (0x18L << 1),
    COMP_INVREF_VREF1SEL_25               = (0x19L << 1),
    COMP_INVREF_VREF1SEL_26               = (0x1AL << 1),
    COMP_INVREF_VREF1SEL_27               = (0x1BL << 1),
    COMP_INVREF_VREF1SEL_28               = (0x1CL << 1),
    COMP_INVREF_VREF1SEL_29               = (0x1DL << 1),
    COMP_INVREF_VREF1SEL_30               = (0x1EL << 1),
    COMP_INVREF_VREF1SEL_31               = (0x1FL << 1),
    COMP_INVREF_VREF1SEL_32               = (0x20L << 1),
    COMP_INVREF_VREF1SEL_33               = (0x21L << 1),
    COMP_INVREF_VREF1SEL_34               = (0x22L << 1),
    COMP_INVREF_VREF1SEL_35               = (0x23L << 1),
    COMP_INVREF_VREF1SEL_36               = (0x24L << 1),
    COMP_INVREF_VREF1SEL_37               = (0x25L << 1),
    COMP_INVREF_VREF1SEL_38               = (0x26L << 1),
    COMP_INVREF_VREF1SEL_39               = (0x27L << 1),
    COMP_INVREF_VREF1SEL_40               = (0x28L << 1),
    COMP_INVREF_VREF1SEL_41               = (0x29L << 1),
    COMP_INVREF_VREF1SEL_42               = (0x2AL << 1),
    COMP_INVREF_VREF1SEL_43               = (0x2BL << 1),
    COMP_INVREF_VREF1SEL_44               = (0x2CL << 1),
    COMP_INVREF_VREF1SEL_45               = (0x2DL << 1),
    COMP_INVREF_VREF1SEL_46               = (0x2EL << 1),
    COMP_INVREF_VREF1SEL_47               = (0x2FL << 1),
    COMP_INVREF_VREF1SEL_48               = (0x30L << 1),
    COMP_INVREF_VREF1SEL_49               = (0x31L << 1),
    COMP_INVREF_VREF1SEL_50               = (0x32L << 1),
    COMP_INVREF_VREF1SEL_51               = (0x33L << 1),
    COMP_INVREF_VREF1SEL_52               = (0x34L << 1),
    COMP_INVREF_VREF1SEL_53               = (0x35L << 1),
    COMP_INVREF_VREF1SEL_54               = (0x36L << 1),
    COMP_INVREF_VREF1SEL_55               = (0x37L << 1),
    COMP_INVREF_VREF1SEL_56               = (0x38L << 1),
    COMP_INVREF_VREF1SEL_57               = (0x39L << 1),
    COMP_INVREF_VREF1SEL_58               = (0x3AL << 1),
    COMP_INVREF_VREF1SEL_59               = (0x3BL << 1),
    COMP_INVREF_VREF1SEL_60               = (0x3CL << 1),
    COMP_INVREF_VREF1SEL_61               = (0x3DL << 1),
    COMP_INVREF_VREF1SEL_62               = (0x3EL << 1),
    COMP_INVREF_VREF1SEL_63               = (0x3FL << 1),
    COMP_INVREF_VREF2SEL_0                = (0x0L << 8),
    COMP_INVREF_VREF2SEL_1                = (0x1L << 8),
    COMP_INVREF_VREF2SEL_2                = (0x2L << 8),
    COMP_INVREF_VREF2SEL_3                = (0x3L << 8),
    COMP_INVREF_VREF2SEL_4                = (0x4L << 8),
    COMP_INVREF_VREF2SEL_5                = (0x5L << 8),
    COMP_INVREF_VREF2SEL_6                = (0x6L << 8),
    COMP_INVREF_VREF2SEL_7                = (0x7L << 8),
    COMP_INVREF_VREF2SEL_8                = (0x8L << 8),
    COMP_INVREF_VREF2SEL_9                = (0x9L << 8),
    COMP_INVREF_VREF2SEL_10               = (0xAL << 8),
    COMP_INVREF_VREF2SEL_11               = (0xBL << 8),
    COMP_INVREF_VREF2SEL_12               = (0xCL << 8),
    COMP_INVREF_VREF2SEL_13               = (0xDL << 8),
    COMP_INVREF_VREF2SEL_14               = (0xEL << 8),
    COMP_INVREF_VREF2SEL_15               = (0xFL << 8),
    COMP_INVREF_VREF2SEL_16               = (0x10L << 8),
    COMP_INVREF_VREF2SEL_17               = (0x11L << 8),
    COMP_INVREF_VREF2SEL_18               = (0x12L << 8),
    COMP_INVREF_VREF2SEL_19               = (0x13L << 8),
    COMP_INVREF_VREF2SEL_20               = (0x14L << 8),
    COMP_INVREF_VREF2SEL_21               = (0x15L << 8),
    COMP_INVREF_VREF2SEL_22               = (0x16L << 8),
    COMP_INVREF_VREF2SEL_23               = (0x17L << 8),
    COMP_INVREF_VREF2SEL_24               = (0x18L << 8),
    COMP_INVREF_VREF2SEL_25               = (0x19L << 8),
    COMP_INVREF_VREF2SEL_26               = (0x1AL << 8),
    COMP_INVREF_VREF2SEL_27               = (0x1BL << 8),
    COMP_INVREF_VREF2SEL_28               = (0x1CL << 8),
    COMP_INVREF_VREF2SEL_29               = (0x1DL << 8),
    COMP_INVREF_VREF2SEL_30               = (0x1EL << 8),
    COMP_INVREF_VREF2SEL_31               = (0x1FL << 8),
    COMP_INVREF_VREF2SEL_32               = (0x20L << 8),
    COMP_INVREF_VREF2SEL_33               = (0x21L << 8),
    COMP_INVREF_VREF2SEL_34               = (0x22L << 8),
    COMP_INVREF_VREF2SEL_35               = (0x23L << 8),
    COMP_INVREF_VREF2SEL_36               = (0x24L << 8),
    COMP_INVREF_VREF2SEL_37               = (0x25L << 8),
    COMP_INVREF_VREF2SEL_38               = (0x26L << 8),
    COMP_INVREF_VREF2SEL_39               = (0x27L << 8),
    COMP_INVREF_VREF2SEL_40               = (0x28L << 8),
    COMP_INVREF_VREF2SEL_41               = (0x29L << 8),
    COMP_INVREF_VREF2SEL_42               = (0x2AL << 8),
    COMP_INVREF_VREF2SEL_43               = (0x2BL << 8),
    COMP_INVREF_VREF2SEL_44               = (0x2CL << 8),
    COMP_INVREF_VREF2SEL_45               = (0x2DL << 8),
    COMP_INVREF_VREF2SEL_46               = (0x2EL << 8),
    COMP_INVREF_VREF2SEL_47               = (0x2FL << 8),
    COMP_INVREF_VREF2SEL_48               = (0x30L << 8),
    COMP_INVREF_VREF2SEL_49               = (0x31L << 8),
    COMP_INVREF_VREF2SEL_50               = (0x32L << 8),
    COMP_INVREF_VREF2SEL_51               = (0x33L << 8),
    COMP_INVREF_VREF2SEL_52               = (0x34L << 8),
    COMP_INVREF_VREF2SEL_53               = (0x35L << 8),
    COMP_INVREF_VREF2SEL_54               = (0x36L << 8),
    COMP_INVREF_VREF2SEL_55               = (0x37L << 8),
    COMP_INVREF_VREF2SEL_56               = (0x38L << 8),
    COMP_INVREF_VREF2SEL_57               = (0x39L << 8),
    COMP_INVREF_VREF2SEL_58               = (0x3AL << 8),
    COMP_INVREF_VREF2SEL_59               = (0x3BL << 8),
    COMP_INVREF_VREF2SEL_60               = (0x3CL << 8),
    COMP_INVREF_VREF2SEL_61               = (0x3DL << 8),
    COMP_INVREF_VREF2SEL_62               = (0x3EL << 8),
    COMP_INVREF_VREF2SEL_63               = (0x3FL << 8)
} COMP_INVREF_VREFXSEL_ENUM;



// COMPx_CTRL
#define COMP1_CTRL_CLKSEL_MASK  (0x01L << 20)
#define COMP1_CTRL_PWRMODE_MASK (0x01L << 19)
#define COMP2_CTRL_WINOUT_MASK  (0x01L << 18)
#define COMP_CTRL_OUT_MASK      (0x01L << 17)
#define COMP_CTRL_BLKING_MASK   (0x07L << 14)
#define COMP_CTRL_HYST_MASK     (0x03L << 12)
#define COMP_CTRL_POL_MASK      (0x01L << 11)
#define COMP_CTRL_OUTTRG_MASK   (0x0FL << 7)
#define COMP_CTRL_INPSEL_MASK   (0x03L << 4)
#define COMP_CTRL_INMSEL_MASK   (0x03L << 1)
#define COMP_CTRL_EN_MASK       (0x01L << 0)


/**
 * @}
 */

/** @addtogroup COMP_CTRL_CLKSEL
 * @{
 */
#define IS_COMP_CTRL_CLKSEL(SOURCE) (((SOURCE) == COMP_CTRL_CLKSEL_SYSTEMCLK) || ((SOURCE) == COMP_CTRL_CLKSEL_LSX))


/**
 * @}
 */

/** @addtogroup COMP_CTRL_PWRMD
 * @{
 */
#define IS_COMP_CTRL_PWRMD(SOURCE) (((SOURCE) == COMP_CTRL_PWRMD_NORMAL) || ((SOURCE) == COMP_CTRL_PWRMD_LOWPWR))


/**
 * @}
 */

/** @addtogroup COMP_CTRL_BLKING
 * @{
 */
#define IS_COMP_CTRL_BLKING(SOURCE) (((SOURCE) == COMP_CTRL_BLKING_NO) || ((SOURCE) == COMP_CTRL_BLKING_TIM1_OC5)    \
                                  || ((SOURCE) == COMP_CTRL_BLKING_TIM8_OC5))

/**
 * @}
 */

