Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_comp.h
/** @addtogroup COMP_CTRL_HYST
 * @{
 */
#define IS_COMP_CTRL_HYST(SOURCE) (((SOURCE) == COMP_CTRL_HYST_NO) || ((SOURCE) == COMP_CTRL_HYST_LOW)    \
                                || ((SOURCE) == COMP_CTRL_HYST_MID) || ((SOURCE) == COMP_CTRL_HYST_HIGH))

/**
 * @}
 */

/** @addtogroup COMP_CTRL_POL
 * @{
 */
#define IS_COMP_CTRL_POL(SOURCE) (((SOURCE) == COMP_CTRL_POL_NONINVERTED) || ((SOURCE) == COMP_CTRL_POL_INVERTED))

/**
 * @}
 */

/** @addtogroup COMP_CTRL_OUTTRG
 * @{
 */
#define IS_COMPX_CTRL_OUTTRG(SOURCE) (((SOURCE) == COMPx_CTRL_OUTTRG_NC) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM1_BKIN)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM1_IC1) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM1_OCrefclear)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM8_IC1) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM8_OCrefclear)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM3_IC1) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM3_OCrefclear)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM4_IC1) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM4_OCrefclear)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN) || ((SOURCE) == COMP1_CTRL_OUTTRG_TIM8_BKIN)  \
                                   || ((SOURCE) == COMP1_CTRL_OUTTRG_LPTIM_ETR) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM1_BKIN)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM1_IC1) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM1_OCrefclear)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM8_IC1) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM8_OCrefclear)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM3_IC2) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM3_OCrefclear)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM4_IC2) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM4_OCrefclear)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN) || ((SOURCE) == COMP2_CTRL_OUTTRG_TIM8_BKIN)  \
                                   || ((SOURCE) == COMP2_CTRL_OUTTRG_LPTIM_ETR) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM1_BKIN)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM1_IC1) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM1_OCrefclear)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM8_IC1) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM8_OCrefclear)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM3_IC3) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM3_OCrefclear)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM4_IC3) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM4_OCrefclear)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM1_BKIN_TIM8_BKIN) || ((SOURCE) == COMP3_CTRL_OUTTRG_TIM8_BKIN)  \
                                   || ((SOURCE) == COMP3_CTRL_OUTTRG_LPTIM_ETR))

/**
 * @}
 */

/** @addtogroup COMP_CTRL_INPSEL
 * @{
 */
#define IS_COMPX_CTRL_INPSEL(SOURCE) (((SOURCE) == COMP1_CTRL_INPSEL_PA1) || ((SOURCE) == COMP1_CTRL_INPSEL_PA3)  \
                                   || ((SOURCE) == COMP1_CTRL_INPSEL_PA6) || ((SOURCE) == COMP1_CTRL_INPSEL_PA7)  \
                                   || ((SOURCE) == COMP1_CTRL_INPSEL_PA12) || ((SOURCE) == COMP1_CTRL_INPSEL_PF7)  \
                                   || ((SOURCE) == COMP2_CTRL_INPSEL_PA1) || ((SOURCE) == COMP2_CTRL_INPSEL_PA9)  \
                                   || ((SOURCE) == COMP2_CTRL_INPSEL_PB4) || ((SOURCE) == COMP2_CTRL_INPSEL_PB5)  \
                                   || ((SOURCE) == COMP2_CTRL_INPSEL_PB6) || ((SOURCE) == COMP2_CTRL_INPSEL_PB7)  \
                                   || ((SOURCE) == COMP3_CTRL_INPSEL_PF1) || ((SOURCE) == COMP3_CTRL_INPSEL_PC7)  \
                                   || ((SOURCE) == COMP3_CTRL_INPSEL_PA11) || ((SOURCE) == COMP3_CTRL_INPSEL_PF6)  \
                                   || ((SOURCE) == COMPx_CTRL_INPSEL_VREF2) || ((SOURCE) == COMPx_CTRL_INPSEL_VREF1))

/**
 * @}
 */

/** @addtogroup COMP_CTRL_INPSEL
 * @{
 */
#define IS_COMPX_CTRL_INMSEL(SOURCE) (((SOURCE) == COMP1_CTRL_INMSEL_PA0) || ((SOURCE) == COMP1_CTRL_INMSEL_PA4)  \
                                   || ((SOURCE) == COMP1_CTRL_INMSEL_PA5) || ((SOURCE) == COMP1_CTRL_INMSEL_PF6)  \
                                   || ((SOURCE) == COMP2_CTRL_INMSEL_PA3) || ((SOURCE) == COMP2_CTRL_INMSEL_PA2)  \
                                   || ((SOURCE) == COMP2_CTRL_INMSEL_PA4) || ((SOURCE) == COMP2_CTRL_INMSEL_PA5)  \
                                   || ((SOURCE) == COMP2_CTRL_INMSEL_PA8) || ((SOURCE) == COMP2_CTRL_INMSEL_PB3)  \
                                   || ((SOURCE) == COMP3_CTRL_INMSEL_PF0) || ((SOURCE) == COMP3_CTRL_INMSEL_PC6)  \
                                   || ((SOURCE) == COMP3_CTRL_INMSEL_PA12) || ((SOURCE) == COMP3_CTRL_INMSEL_PF7)  \
                                   || ((SOURCE) == COMPx_CTRL_INMSEL_VREF2) || ((SOURCE) == COMPx_CTRL_INMSEL_VREF1))

//COMPx_FILC
#define COMP_FILC_SAMPW_MASK         (0x1FL<<6) //Low filter sample window size. Number of samples to monitor is SAMPWIN+1.
#define COMP_FILC_THRESH_MASK        (0x1FL<<1) //For proper operation, the value of THRESH must be greater than SAMPWIN / 2.
#define COMP_FILC_FILEN_MASK         (0x01L<<0) //Filter enable.

//COMPx_FILP
#define COMP_FILP_CLKPSC_MASK        (uint16_t)(0xFFFFFF) //Low filter sample clock prescale.
#define IS_COMP_FILP_CLKPSC(SOURCE) ((SOURCE) <= COMP_FILP_CLKPSC_MASK)

//COMP_WINMODE
#define COMP_WINMODE_CMP12MD_MASK    ((uint32_t)0x01L <<0) // Comparators 1 and 2 can be used in window mode.
#define COMP_WINMODE_WINMDINSEL_MASK ((uint32_t)0x03L <<1) // Comparators 1 and 2 can be used in window mode Input Selection.

//COMP_INTEN
#define COMP_INTEN_CMPIEN_MSK        (0x07L << 0) // This bit control Interrput enable of COMP.

//COMP_INTSTS
#define COMP_INTSTS_INTSTS_MSK       (0x07L << 0) // This bit control Interrput enable of COMP.

//COMP_INVREF
#define COMP_INVREF_VREF2SEL_MSK     (0x2FL << 7) // Vref2 Voltage scaler value.
#define COMP_INVREF_VREF2EN_ENABLE   (0x01L << 6)
#define COMP_INVREF_VREF2EN_DISABLE  (0x00L << 6)
#define COMP_INVREF_VREF1SEL_MSK     (0x2FL << 1) // Vref1 Voltage scaler value.
#define COMP_INVREF_VREF1EN_ENABLE   (0x01L << 0)
#define COMP_INVREF_VREF1EN_DISABLE  (0x00L << 0)

//COMP_LOCK
#define COMP_LOCK_CMP1LK_MASK        (0x1L << 0)
#define COMP_LOCK_CMP2LK_MASK        (0x1L << 1)
#define COMP_LOCK_CMP3LK_MASK        (0x1L << 2)

/**
 * @}
 */

/**
 * @brief  COMP Init structure definition
 */

typedef struct
{
    // COMP_CTRL
    COMP_CTRL_CLKSEL_ENUM  ClockSelect; // only COMP1 have this bit
    COMP_CTRL_PWRMD_ENUM   LowPoweMode; // only COMP1 have this bit
    bool windowout;                     // only COMP2 have this bit

    COMP_CTRL_BLKING_ENUM  Blking;      /*see @ref COMP_CTRL_BLKING */
    COMP_CTRL_HYST_ENUM    Hyst;
    COMP_CTRL_POL_ENUM     PolRev;      // out polarity reverse
    COMP_CTRL_OUTTRG_ENUM  OutTrg;
    COMP_CTRL_INPSEL_ENUM  InpSel;
    COMP_CTRL_INMSEL_ENUM  InmSel;
    //COMP_CTRL_EN En;
    // filter
    COMPX_FILC_SAMPW_ENUM  SampWindow;           // 5bit
    COMPX_FILC_THRESH_ENUM Thresh;               // 5bit ,need > SampWindow/2
    COMPX_FILC_FILEN_ENUM  FilterEn;
    // filter psc
    uint16_t ClkPsc;
} COMP_InitType;

/** @addtogroup COMP_Exported_Functions
 * @{
 */

void COMP_DeInit(void);
void COMP_StructInit(COMP_InitType* COMP_InitStruct);
void COMP_Init(COMPX COMPx, COMP_InitType* COMP_InitStruct);
void COMP_Enable(COMPX COMPx, COMP_CTRL_EN_ENUM Cmd);
void COMP_SetInpSel(COMPX COMPx, COMP_CTRL_INPSEL_ENUM Inpsel);
void COMP_SetInmSel(COMPX COMPx, COMP_CTRL_INMSEL_ENUM Inmsel);
void COMP_SetOutTrig(COMPX COMPx, COMP_CTRL_OUTTRG_ENUM OutTrig);                                          
void COMP_ConfigInt(COMP_INTEN_CMPXIEN_ENUM COMPx_INT, FunctionalState Cmd);                                                 // return see @COMP_INTSTS_CMPIS
INTStatus COMP_GetIntStatus(COMP_INTSTS_STATUS_ENUM status);
void COMP_ConfigWindowMode(COMP_WINMODE_WINMDINSEL_ENUM WinMdInSel, COMP_WINMODE_CMP12MD_ENUM Cmd);
FlagStatus COMP_GetCompOutStatus(COMPX COMPx);
void COMP_ConfigCTRLLock(COMP_LOCK_CMPXLK_ENUM COMPx_LOCK, FunctionalState Cmd);                                              // see @COMP_LOCK_CMPLK
void COMP_ConfigVREFx(VREFX_ENUM Vrefx, COMP_INVREF_VREFXSEL_ENUM COMP_VREFx, FunctionalState Cmd);                                            // see @COMP_INTEN_CMPIEN

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /*__N32G032_ADC_H */
/**
 * @}
 */
/**
 * @}
 */
